mock-example/src/test/resources/xml/CRM/ForceSignal/rq1.xml

<?xml version="1.0" encoding="UTF-8"?><soap-env:Envelope xmlns:soap-env="http://schemas.xmlsoap.org/soap/envelope/">
    <soap-env:Header xmlns:rs="http://sbrf.ru/NCP/CRM/ForceSignalRs/" xmlns:rsd="http://sbrf.ru/NCP/CRM/ForceSignalRq/Data/" xmlns:rq="http://sbrf.ru/NCP/CRM/ForceSignalRq/" xmlns:crm="http://sbrf.ru/NCP/CRM/"/>
    <soap-env:Body xmlns:rs="http://sbrf.ru/NCP/CRM/ForceSignalRs/" xmlns:rsd="http://sbrf.ru/NCP/CRM/ForceSignalRq/Data/" xmlns:rq="http://sbrf.ru/NCP/CRM/ForceSignalRq/" xmlns:crm="http://sbrf.ru/NCP/CRM/">
        <crm:forceSignalRq>
            <rq:contractID>string1</rq:contractID>
            <rq:contractBPMID>string2</rq:contractBPMID>
            <rq:status>string3</rq:status>
            <rq:comment>string4</rq:comment>
            <rq:requestType>string5</rq:requestType>
            <rq:fullNameOfResponsiblePerson>string6</rq:fullNameOfResponsiblePerson>
            <rq:participantsGroup>
                <rq:id>string1</rq:id>
                <rq:label>string2</rq:label>
                <rq:status>string3</rq:status>
                <rq:updateDate>2008-09-04</rq:updateDate>
                <rq:approvalDate>2014-09-05</rq:approvalDate>
                <rq:topLevelGroupName>string6</rq:topLevelGroupName>
            </rq:participantsGroup>
        </crm:forceSignalRq>
    </soap-env:Body>
</soap-env:Envelope>
